zyitom/test_slave_bridge/firmware/ch32_board/bsp/usb/ch32h417_usbhs_device.c
/********************************** (C) COPYRIGHT *******************************
 * File Name          : ch32h417_usbhs_device.c
 * Author             : WCH
 * Version            : V1.0.0
 * Date               : 2025/05/26
 * Description        : This file provides all the USBHS firmware functions.
 *********************************************************************************
 * Copyright (c) 2025 Nanjing Qinheng Microelectronics Co., Ltd.
 * Attention: This software (modified or not) and binary are used for
 * microcontroller manufactured by Nanjing Qinheng Microelectronics.
 *******************************************************************************/
#include "ch32h417_usbhs_device.h"
#include "ch32h417_usbss_device.h"
#include "usb_desc.h"
/******************************************************************************/
/* Variable Definition */
/* test mode */
volatile uint8_t USBHS_Test_Flag;
__attribute__((aligned(4))) uint8_t IFTest_Buf[53] =
{
    0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00, 0x00,
    0xAA, 0xAA, 0xAA, 0xAA, 0xAA, 0xAA, 0xAA, 0xAA,
    0xEE, 0xEE, 0xEE, 0xEE, 0xEE, 0xEE, 0xEE, 0xEE,
    0xFE,                                                              // 26
    0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF, 0xFF,  // 37
    0x7F, 0xBF, 0xDF, 0xEF, 0xF7, 0xFB, 0xFD,                          // 44
    0xFC, 0x7E, 0xBF, 0xDF, 0xEF, 0xF7, 0xFB, 0xFD, 0x7E               // 53
};

/* Global */
const uint8_t *pUSBHS_Descr;

/* Setup Request */
volatile uint8_t USBHS_SetupReqCode;
volatile uint8_t USBHS_SetupReqType;
volatile uint16_t USBHS_SetupReqValue;
volatile uint16_t USBHS_SetupReqIndex;
volatile uint16_t USBHS_SetupReqLen;

/* USB Device Status */
volatile uint8_t USBHS_DevConfig;
volatile uint8_t USBHS_DevAddr;
volatile uint16_t USBHS_DevMaxPackLen;
volatile uint8_t USBHS_DevSpeed;
volatile uint8_t USBHS_DevSleepStatus;
volatile uint8_t USBHS_DevEnumStatus;

/* Endpoint Buffer */
__attribute__((aligned(4))) uint8_t USBHS_EP0_Buf[DEF_USBD_UEP0_SIZE];
__attribute__((aligned(4))) uint8_t USBHS_EP3_Rx_Buf[DEF_USB_EP3_HS_SIZE];
__attribute__((aligned(4))) uint8_t USBHS_EP5_Rx_Buf[DEF_USB_EP5_HS_SIZE];
__attribute__((aligned(4))) uint8_t USBHS_EP4_Tx_Buf[DEF_USB_EP4_HS_SIZE];
__attribute__((aligned(4))) uint8_t USBHS_EP6_Tx_Buf[DEF_USB_EP6_HS_SIZE];

/* Ring buffer */
RING_BUFF_COMM RingBuffer_Comm;
__attribute__((aligned(4))) uint8_t Data_Buffer[DEF_RING_BUFFER_SIZE];

/* Interrupt Service Routine Declaration*/
void USBHS_IRQHandler(void) __attribute__((interrupt("WCH-Interrupt-fast")));


/*********************************************************************
 * @fn      USB_TestMode_Deal
 *
 * @brief   Eye Diagram Test Function Processing.
 *
 * @return  none
 *
 */
void USB_TestMode_Deal(void)
{
#if TEST_ENABLE == 0x01
    /* start test */
    USBHS_Test_Flag &= ~0x80;

    if(USBHS_SetupReqIndex == 0x0100)
    {
        /* Test_J */
        USBHSD->TEST_MODE &= ~TEST_MASK;
        USBHSD->TEST_MODE |= USBHS_UD_TEST_J;
    }
    else if(USBHS_SetupReqIndex == 0x0200)
    {
        /* Test_K */
        USBHSD->TEST_MODE &= ~TEST_MASK;
        USBHSD->TEST_MODE |= USBHS_UD_TEST_K;
    }
    else if(USBHS_SetupReqIndex == 0x0300)
    {
        /* Test_SE0_NAK */
        USBHSD->TEST_MODE &= ~TEST_MASK;
        USBHSD->TEST_MODE |= USBHS_UD_TEST_SE0NAK;
    }
    else if(USBHS_SetupReqIndex == 0x0400)
    {
        /* Test_Packet */
        USBHSD->TEST_MODE &= ~TEST_MASK;
        USBHSD->UEP4_TX_DMA = (uint32_t)(&IFTest_Buf[0]);
        USBHSD->UEP4_TX_LEN = 53;
        USBHSD->UEP4_TX_CTRL = USBHS_UEP_T_RES_ACK;
        USBHSD->TEST_MODE |= USBHS_UD_TEST_PKT;
    }
    USBHSD->TEST_MODE |= USBHS_UD_TEST_EN;
#endif
}


/*********************************************************************
 * @fn      USBHS_Device_Endp_Init
 *
 * @brief   Initializes USB device endpoints.
 *
 * @return  none
 */
void USBHS_Device_Endp_Init(void)
{
    USBHSD->UEP_TX_EN = USBHS_UEP0_T_EN | USBHS_UEP1_T_EN | USBHS_UEP4_T_EN | USBHS_UEP6_T_EN;
    USBHSD->UEP_RX_EN = USBHS_UEP0_R_EN | USBHS_UEP1_R_EN | USBHS_UEP3_R_EN | USBHS_UEP5_R_EN;

    USBHSD->UEP0_MAX_LEN = DEF_USBD_UEP0_SIZE;
    USBHSD->UEP1_MAX_LEN = DEF_USB_EP1_HS_SIZE;
    USBHSD->UEP2_MAX_LEN = DEF_USB_EP2_HS_SIZE;
    USBHSD->UEP3_MAX_LEN = DEF_USB_EP3_HS_SIZE;
    USBHSD->UEP4_MAX_LEN = DEF_USB_EP4_HS_SIZE;
    USBHSD->UEP5_MAX_LEN = DEF_USB_EP5_HS_SIZE;
    USBHSD->UEP6_MAX_LEN = DEF_USB_EP6_HS_SIZE;

    USBHSD->UEP0_DMA = (uint32_t)(uint8_t *)USBHS_EP0_Buf;

    USBHSD->UEP1_RX_DMA = (uint32_t)(uint8_t *)Data_Buffer;
    USBHSD->UEP3_RX_DMA = (uint32_t)(uint8_t *)USBHS_EP3_Rx_Buf;
    USBHSD->UEP5_RX_DMA = (uint32_t)(uint8_t *)USBHS_EP5_Rx_Buf;

    USBHSD->UEP1_TX_DMA = (uint32_t)(uint8_t *)Data_Buffer;
    USBHSD->UEP4_TX_DMA = (uint32_t)(uint8_t *)USBHS_EP4_Tx_Buf;
    USBHSD->UEP6_TX_DMA = (uint32_t)(uint8_t *)USBHS_EP6_Tx_Buf;

    USBHSD->UEP0_TX_LEN = 0;
    USBHSD->UEP0_TX_CTRL = USBHS_UEP_T_RES_NAK;
    USBHSD->UEP0_RX_CTRL = USBHS_UEP_R_RES_ACK;

    USBHSD->UEP1_RX_CTRL = USBHS_UEP_R_RES_ACK;
    USBHSD->UEP3_RX_CTRL = USBHS_UEP_R_RES_ACK;
    USBHSD->UEP5_RX_CTRL = USBHS_UEP_R_RES_ACK;

    USBHSD->UEP1_TX_LEN = 0;
    USBHSD->UEP1_TX_CTRL = USBHS_UEP_T_RES_NAK;

    USBHSD->UEP4_TX_LEN = 0;
    USBHSD->UEP4_TX_CTRL = USBHS_UEP_T_RES_NAK;

    USBHSD->UEP6_TX_LEN = 0;
    USBHSD->UEP6_TX_CTRL = USBHS_UEP_T_RES_NAK;
}

/*********************************************************************
 * @fn      USBHS_RCC_Init
 *
 * @brief   Initializes USB high-speed rcc.
 *
 * @return  none
 */
void USBHS_RCC_Init(FunctionalState sta)
{
    if (sta)
    {
        if((RCC->PLLCFGR & RCC_SYSPLL_SEL) != RCC_SYSPLL_USBHS)
        {
            /* Initialize USBHS 480M PLL */
            RCC_USBHS_PLLCmd(DISABLE);
            RCC_USBHSPLLCLKConfig(RCC_USBHSPLLSource_HSE);
            RCC_USBHSPLLReferConfig(RCC_USBHSPLLRefer_25M);
            RCC_USBHSPLLClockSourceDivConfig(RCC_USBHSPLL_IN_Div1);
            RCC_USBHS_PLLCmd(ENABLE);
            while (!(RCC->CTLR & RCC_USBHS_PLLRDY));
        }
        /* Enable UTMI Clock */
        RCC_UTMIcmd(ENABLE);
        /* Enable USBHS Clock */
        RCC_HBPeriphClockCmd(RCC_HBPeriph_USBHS, ENABLE);
    }
    else
    {
        RCC_HBPeriphClockCmd(RCC_HBPeriph_USBHS, DISABLE);
        RCC_UTMIcmd(DISABLE);
        if((RCC->PLLCFGR & RCC_SYSPLL_SEL) != RCC_SYSPLL_USBHS)
        {
            RCC_USBHS_PLLCmd(DISABLE);
        }
    }
}

/*********************************************************************
 * @fn      USBHS_Device_Init
 *
 * @brief   Initializes USB high-speed device.
 *
 * @return  none
 */
void USBHS_Device_Init(FunctionalState sta)
{
    if(sta)
    {
        USBHS_RCC_Init(ENABLE);
        USBHSD->CONTROL = USBHS_UD_RST_LINK | USBHS_UD_PHY_SUSPENDM;
        USBHSD->INT_EN = USBHS_UDIE_BUS_RST | USBHS_UDIE_SUSPEND | USBHS_UDIE_BUS_SLEEP | USBHS_UDIE_LPM_ACT | USBHS_UDIE_TRANSFER | USBHS_UDIE_LINK_RDY;
        USBHS_Device_Endp_Init();
        USBHSD->BASE_MODE = USBHS_UD_SPEED_HIGH;
        USBHSD->CONTROL = USBHS_UD_DEV_EN | USBHS_UD_DMA_EN | USBHS_UD_LPM_EN | USBHS_UD_PHY_SUSPENDM;
        NVIC_EnableIRQ(USBHS_IRQn);
    }
    else
    {
        USBHSD->CONTROL = USBHS_UD_RST_SIE | USBHS_UD_RST_LINK;
        NVIC_DisableIRQ(USBHS_IRQn);
        USBHS_RCC_Init(DISABLE);
    }
}

/*********************************************************************
 * @fn      USBHS_IRQHandler
 *
 * @brief   This function handles USBHS exception.
 *
 * @return  none
 */
void USBHS_IRQHandler(void)
{
    uint8_t intflag, intst, errflag;
    uint16_t len, i;
    uint8_t endp_num;

    intflag = USBHSD->INT_FG;
    intst = USBHSD->INT_ST;
    
    if(intflag & USBHS_UDIF_TRANSFER)
    {
        endp_num = intst & USBHS_UDIS_EP_ID_MASK;
        if(!(intst & USBHS_UDIS_EP_DIR))  // SETUP/OUT Transaction
        {
            switch(endp_num)
            {
            case DEF_UEP0:
                USBHSD->UEP0_RX_CTRL &= ~USBHS_UEP_R_DONE;
                if(USBHSD->UEP0_RX_CTRL & USBHS_UEP_R_SETUP_IS)
                {
                    /* Store All Setup Values */
                    USBHS_SetupReqType = pUSBHS_SetupReqPak->bRequestType;
                    USBHS_SetupReqCode = pUSBHS_SetupReqPak->bRequest;
                    USBHS_SetupReqLen = pUSBHS_SetupReqPak->wLength;
                    USBHS_SetupReqValue = pUSBHS_SetupReqPak->wValue;
                    USBHS_SetupReqIndex = pUSBHS_SetupReqPak->wIndex;

                    len = 0;
                    errflag = 0;
                    if((USBHS_SetupReqType & USB_REQ_TYP_MASK) != USB_REQ_TYP_STANDARD)
                    {
                        /* usb non-standard request processing */
                        errflag = 0xFF;
                    }
                    else
                    {
                        /* usb standard request processing */
                        switch(USBHS_SetupReqCode)
                        {
                        /* get device/configuration/string/report/... descriptors */
                        case USB_GET_DESCRIPTOR:
                            switch((uint8_t)(USBHS_SetupReqValue >> 8))
                            {
                            /* get usb device descriptor */
                            case USB_DESCR_TYP_DEVICE:
                                pUSBHS_Descr = MyDevDescr;
                                len = DEF_USBD_DEVICE_DESC_LEN;
                                break;

                            /* get usb configuration descriptor */
                            case USB_DESCR_TYP_CONFIG:
                                /* Query current usb speed */
                                if(USBHSD->MIS_ST & USBHS_UDMS_HS_MOD)
                                {
                                    /* High speed mode */
                                    USBHS_DevSpeed = USBHS_SPEED_HIGH;
                                    USBHS_DevMaxPackLen = DEF_USBD_HS_PACK_SIZE;
                                }
                                else
                                {
                                    /* Full speed mode */
                                    USBHS_DevSpeed = USBHS_SPEED_FULL;
                                    USBHS_DevMaxPackLen = DEF_USBD_FS_PACK_SIZE;
                                }

