zyitom/test_slave_bridge/firmware/ch32_board/bsp/usb/ch32h417_usbhs_device.c
                                /* Load usb configuration descriptor by speed */
                                if(USBHS_DevSpeed == USBHS_SPEED_HIGH)
                                {
                                    /* High speed mode */
                                    pUSBHS_Descr = MyCfgDescr_HS;
                                    len = DEF_USBD_CONFIG_HS_DESC_LEN;
                                }
                                else
                                {
                                    /* Full speed mode */
                                    pUSBHS_Descr = MyCfgDescr_FS;
                                    len = DEF_USBD_CONFIG_FS_DESC_LEN;
                                }
                                break;

                            /* get usb string descriptor */
                            case USB_DESCR_TYP_STRING:
                                switch((uint8_t)(USBHS_SetupReqValue & 0xFF))
                                {
                                /* Descriptor 0, Language descriptor */
                                case DEF_STRING_DESC_LANG:
                                    pUSBHS_Descr = MyLangDescr;
                                    len = DEF_USBD_LANG_DESC_LEN;
                                    break;

                                /* Descriptor 1, Manufacturers String descriptor */
                                case DEF_STRING_DESC_MANU:
                                    pUSBHS_Descr = MyManuInfo;
                                    len = DEF_USBD_MANU_DESC_LEN;
                                    break;

                                /* Descriptor 2, Product String descriptor */
                                case DEF_STRING_DESC_PROD:
                                    pUSBHS_Descr = MyProdInfo;
                                    len = DEF_USBD_PROD_DESC_LEN;
                                    break;

                                /* Descriptor 3, Serial-number String descriptor */
                                case DEF_STRING_DESC_SERN:
                                    pUSBHS_Descr = MySerNumInfo;
                                    len = DEF_USBD_SN_DESC_LEN;
                                    break;

                                default:
                                    errflag = 0xFF;
                                    break;
                                }
                                break;

                            /* get usb device qualify descriptor */
                            case USB_DESCR_TYP_QUALIF:
                                pUSBHS_Descr = MyQuaDesc;
                                len = DEF_USBD_QUALFY_DESC_LEN;
                                break;

                            /* get usb BOS descriptor */
                            case USB_DESCR_TYP_BOS:
                                /* USB 2.00 DO NOT support BOS descriptor */
                                errflag = 0xFF;
                                break;

                            /* get usb other-speed descriptor */
                            case USB_DESCR_TYP_SPEED:
                                if(USBHS_DevSpeed == USBHS_SPEED_HIGH)
                                {
                                    /* High speed mode */
                                    memcpy(&TAB_USB_HS_OSC_DESC[2], &MyCfgDescr_FS[2], DEF_USBD_CONFIG_FS_DESC_LEN - 2);
                                    pUSBHS_Descr = (uint8_t *)&TAB_USB_HS_OSC_DESC[0];
                                    len = DEF_USBD_CONFIG_FS_DESC_LEN;
                                }
                                else if(USBHS_DevSpeed == USBHS_SPEED_FULL)
                                {
                                    /* Full speed mode */
                                    memcpy(&TAB_USB_FS_OSC_DESC[2], &MyCfgDescr_HS[2], DEF_USBD_CONFIG_HS_DESC_LEN - 2);
                                    pUSBHS_Descr = (uint8_t *)&TAB_USB_FS_OSC_DESC[0];
                                    len = DEF_USBD_CONFIG_HS_DESC_LEN;
                                }
                                else
                                {
                                    errflag = 0xFF;
                                }
                                break;

                            default:
                                errflag = 0xFF;
                                break;
                            }

                            /* Copy Descriptors to Endp0 DMA buffer */
                            if(USBHS_SetupReqLen > len)
                            {
                                USBHS_SetupReqLen = len;
                            }
                            len = (USBHS_SetupReqLen >= DEF_USBD_UEP0_SIZE) ? DEF_USBD_UEP0_SIZE : USBHS_SetupReqLen;
                            memcpy(USBHS_EP0_Buf, pUSBHS_Descr, len);
                            pUSBHS_Descr += len;
                            break;

                        /* Set usb address */
                        case USB_SET_ADDRESS:
                            USBHS_DevAddr = (uint16_t)(USBHS_SetupReqValue & 0xFF);
                            break;

                        /* Get usb configuration now set */
                        case USB_GET_CONFIGURATION:
                            USBHS_EP0_Buf[0] = USBHS_DevConfig;
                            if(USBHS_SetupReqLen > 1)
                            {
                                USBHS_SetupReqLen = 1;
                            }
                            break;

                        /* Set usb configuration to use */
                        case USB_SET_CONFIGURATION:
                            USBHS_DevConfig = (uint8_t)(USBHS_SetupReqValue & 0xFF);
                            USBHS_DevEnumStatus = 0x01;
                            USB_Enum_Status = U2U3_SUCC;
                            break;

